---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericDiffuse
source: html/2e8dc667-7c56-d44f-4da2-9c47c355d2ae.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericDiffuse Property

The property labeled "Color/Image" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericDiffuse { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.